Repository: alexax66/boot-environments
Catalog: src/locale/*/boot-environments.po
Languages: ru

source: Backup Station
ru: Центр резервного копирования

source: Select the environment the computer should start into or create new
ru: Выберите загрузочное окружение которое система будет использовать при следующем старте или создайте новое

source: Restart...
ru: Перезапуск...

source: New...
ru: Новое...

source: Rename
ru: Переименовать

source: Remove
ru: Удалить

source: Unmount
ru: Отмотровать

source: Boot Environment
ru: Имя

source: Active
ru: Активно

source: Mountpoint
ru: Точка монтрования

source: Space
ru: Размер

source: Created
ru: Создано

source: Now and on reboot
ru: Сейчас и при сл. старте

source: Now
ru: Сейчас

source: On reboot
ru: При сл. старте

source: Restart
ru: Перезапуск

source: Are you sure you want to restart your computer now? All unsaved work will be lost.
ru: Вы действительно хотите сейчас перезагрузить компьютер? Все несохраненные данные будут потеряны.

source: Mount
ru: Примотировать

source: Error
ru: Ошибка

source: Could not activate Boot Environment
ru: Невозможно активироать это окружение

source: New
ru: Новое

source: Enter Boot Environment name:
ru: Ввдите имя загрузочного окружения:

source: bectl create started
ru: bectl запустил создание

source: bectl create cannot be launched
ru: bectl не может запустить создание

source: Could not create Boot Environment
ru: Не возможно создать загрузочное окружение

source: Do you really want to remove %s? This cannot be undone.
ru: Вы дествительно ходите удалить %s? Эта оперция не может быть отменена

source: Removing: %s
ru: Удаление: %s

source: bectl destroy started
ru: bectl запустил удаление

source: bectl destroy cannot be launched
ru: bectl не может запустить удаление

source: Could not destroy Boot Environment
ru: Невозможно удалить загрузочное окружение

source: Renaming
ru: Переименование

source: Enter new Boot Environment name:
ru: Введите новое имя для загрузочного окружения:

source: Do you really want to rename %s?
ru: Вы дествительно ходите переименовать %s?

source: Renaming: %s
ru: Переименование: %s

source: bectl renaming started
ru: bectl запустил переименование

source: bectl renaming cannot be launched
ru: bectl не может запустить перименование

source: Could not renaming Boot Environment
ru: Не возможно перименовать загрузочное окружение

source: bectl %s cannot be launched
ru: bectl не может запусить %s

source: Could not %s Boot Environment
ru: Невозможно выполнить %s для этого загрузчного окружения

source: &Quit
ru: &Выйти

source: Exit application
ru: Закрыть приложение

source: &File
ru: &Файл

source: &About
ru: &О приложении

source: About this application
ru: Об этом приложении

source: &Usage
ru: Использование

source: How use this application
ru: Как пользоваться этим приложением

source: &Help
ru: &Помощь

source: About
ru: О приложении

source: A simple preferences application to modify <a href='https://bsd-pl.org/assets/talks/2018-07-30_1_S%C5%82awomir-Wojciech-Wojtczak_ZFS-Boot-Environments.pdf'>ZFS Boot Environments</a> <br><br>Source code: <a href='https://github.com/alexax66/backup-station'>https://github.com/alexax66/backup-station</a>
ru: Простое приложение для изменения настроек <a href='https://bsd-pl.org/assets/talks/2018-07-30_1_S%C5%82awomir-Wojciech-Wojtczak_ZFS-Boot-Environments.pdf'> загрузочных сред ZFS</a><br><br>Исходный код: <a href='https://github.com/alexax66/backup-station'>https://github.com/alexax66/backup-station</a>

source: Help
ru: Помощь

source: <h3>Description and usage</h3>
ru: <h3>Описание и использование</h3>

source: <hr><h4>General information</h4 <p>Boot Environments are bootable clones of snapshots of the working system. Before upgrading or making major changes to the system, it is strongly recommended that you create a safe boot environment to recover after a failure occurs. Note that Boot Environments by default may not cover all locations, such as /home. More details about this can be found at: <p><a href='https://www.freebsd.org/cgi/man.cgi?bectl(8)'><b>BECTL(8)</b></a> <p><a href='https://klarasystems.com/articles/basics-of-zfs-snapshot-management/'><b>Basics of ZFS Snapshot Management</b></a> <p><a href='https://klarasystems.com/articles/managing-boot-environments/'><b>Managing boot environments</b></a> <hr><h4>Using interface elements</h4> <ul><li>Select an active environment for the next system boot and check in the its checkbox. At the same time, the its <b>Status</b> field will be <b>On reboot</b>. The <b>Status</b> field can have the following values: <small><table> <thead> <tr> <th>Values</th> <th>Description</th> </tr> </thead> <tbody> <tr> <td>-</td> <td><pre> Nonactive</pre></td> </tr> <tr> <td>Now</td> <td><pre> Active now</pre></td> </tr> <tr> <td>On reboot</td> <td><pre> Will be active on next boot time</pre></td> </tr> <tr> <td>Now and on reboot</td> <td><pre> Active now and will be active on next boot time</pre></td> </tr> </tbody> </table></small></li> <p><li>Click the button <b>[Restart...]</b> to reboot the system into the selected active environment.</li> <p><li>Highlight a line in the list with the cursor and press the <b>[Mount]</b> button to mount the selected environment. In this case, its path will be displayed in the <b>Mount point</b> field.</li> <p><li>Highlight a line in the list with the cursor and press the <b>[Umount]</b> button to unmount the selected environment. In this case, the path will not be displayed in the <b>Mount point</b> field.</li> <p><li>Highlight a line in the list with the cursor and press the <b>[Remove]</b> button to remove the selected environment. This environment will disappear from the list after confirming the deletion.</li> <p><li>Highlight a line in the list with the cursor and press the <b>[Rename]</b> button to rename the selected environment. This environment will appear in the list after entering its new name.</li> <p><li>Click the button <b>[New...]</b> to create a new environment. The new environment will appear in the list after entering its name.</b></li></ul> <p> You must have root privileges to work with this program!
ru: <hr><h4>Общие сведения</h4><p>Загрузочные окружения - это клоны моментальных снимков загрузочной среды текущего состояния системы. Перед обновлением или внесением серьезных изменений в систему настоятельно рекомендуется создавать безопасную загрузочную среду для восстановления после возникновения сбоя. Обратите внимание, что загрузочные оркружения по умолчанию могут не охватывать все расположения данных, например в каталоге /home. Более подробно об этом можно ознакомиться по этим ссылкам: <p><a href='https://www.freebsd.org/cgi/man.cgi?bectl(8)'><b>BECTL(8)</b></a><p><a href='https://klarasystems.com/articles/basics-of-zfs-snapshot-management/'><b>Basics of ZFS Snapshot Management</b></a> <p><a href='https://klarasystems.com/articles/managing-boot-environments/'><b>Managing boot environments</b></a><hr><h4>Использование элементов интерфейса</h4><ul><li>Для выбора активного окружения при следующей загрузке системы, отметьте ее чекбокс флажком. При этом поле <b>Статус</b> оружения станет <b>При сл. старте</b>. Ниже представлены всевозможные значения поля <b>Статсус</b>: <small><table><thead><tr><th>Значение</th><th>Описание</th></tr></thead><tbody><tr><td>-</td><td><pre> Неактивно</pre></td></tr><tr><td>Сейчас</td><td><pre> Активно сейчас</pre></td></tr><tr><td>При сл. загрузке</td><td><pre> Будет активно при следующей загрузке системы</pre></td></tr><tr><td>Сейчас и при сл. загрузке</td><td><pre> Активно сейчас и при следующей загрузке системы</pre></td></tr></tbody></table></small></li><p><li>Для перезагрузки системы в выбранное активное окружение нажмите кнопку <b>[Перезапуск...]</b> </li> <p><li>Для монтрования окружения выделите курсором строку в списке и нажмите кнопку <b>[Примонтировать]</b>. При этом в поле <b>Точка монтирования</b> будет отображаться ее путь.</li><p><li>Для размонтрования окружения выделите курсором строку в списке и нажмите кнопку <b>[Отмонтировать]</b>. При этом в поле <b>Точка монтирования</b> путь отображаться не будет.</li><p><li>Для удаления окружения выделите курсором строку в списке и нажмите кнопку <b>[Удалить]</b>. После подтверждения удаления это окружение отображаться в списке больше не будет.<li> <p><li>Для переименования окружения выделите курсором строку в списке и нажмите кнопку <b>[Переименовать]</b>. После того как Вы введете новое имя, загрузочное окружение появится с новым именем в списке.</li><p><li>Для создания нового окружения нажмите кнопку <b>[Новое....]</b> После того как Вы введете имя, новое загрузочное окружение появится в списке.</li></ul><p>Для работы с программой у Вас должны быть права превилигированного пользователя!
